## Staging: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 39 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_glue_catalog_database.bes_crm_salesforce_production`      |
|        | `aws_glue_catalog_database.operations_aws_production`          |
|        | `aws_glue_catalog_database.operations_aws_production_raw`      |
|        | `aws_glue_catalog_database.platform_gc_forms_production`       |
|        | `aws_glue_catalog_database.platform_gc_forms_production_raw`   |
|        | `aws_glue_catalog_database.platform_gc_notify_production`      |
|        | `aws_glue_catalog_database.platform_support_production`        |
|        | `aws_glue_catalog_database.platform_support_production_raw`    |
|        | `aws_glue_classifier.json_object_array`                        |
|        | `aws_glue_crawler.operations_aws_production_account_tags`      |
|        | `aws_glue_crawler.operations_aws_production_cost_usage_report` |
|        | `aws_glue_crawler.platform_gc_forms_templates_production_raw`  |
|        | `aws_glue_crawler.platform_support_freshdesk_production`       |
|        | `aws_glue_job.bes_crm_salesforce`                              |
|        | `aws_glue_job.platform_gc_forms_job`                           |
|        | `aws_glue_job.platform_gc_notify_job`                          |
|        | `aws_glue_job.platform_support_freshdesk`                      |
|        | `aws_glue_resource_policy.cross_account_access`                |
|        | `aws_glue_security_configuration.encryption_at_rest`           |
|        | `aws_glue_trigger.bes_crm_salesforce`                          |
|        | `aws_glue_trigger.platform_gc_forms_job`                       |
|        | `aws_glue_trigger.platform_gc_notify_job`                      |
|        | `aws_glue_trigger.platform_support_freshdesk`                  |
|        | `aws_iam_policy.glue_crawler`                                  |
|        | `aws_iam_policy.glue_etl`                                      |
|        | `aws_iam_role.glue_crawler`                                    |
|        | `aws_iam_role.glue_etl`                                        |
|        | `aws_iam_role_policy_attachment.aws_glue_service_role`         |
|        | `aws_iam_role_policy_attachment.glue_crawler`                  |
|        | `aws_iam_role_policy_attachment.glue_etl`                      |
|        | `aws_iam_role_policy_attachment.glue_etl_service_role`         |
|        | `aws_kms_alias.data_export`                                    |
|        | `aws_kms_key.aws_glue`                                         |
|        | `aws_s3_object.bes_crm_salesforce_job`                         |
|        | `aws_s3_object.platform_gc_forms_job`                          |
|        | `aws_s3_object.platform_gc_notify_job`                         |
|        | `aws_s3_object.platform_gc_notify_requirements`                |
|        | `aws_s3_object.platform_gc_notify_tables`                      |
|        | `aws_s3_object.platform_support_freshdesk_job`                 |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/data-lake/actions/runs/14996419371).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.aws_glue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_glue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "454671348950",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:Describe*",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "logs.ca-central-1.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.glue_crawler_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_crawler_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:GetObject"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::mock-transformed-bucket/*",
                              + "arn:aws:s3:::mock-raw-bucket/*",
                              + "arn:aws:s3:::mock-glue-bucket/*",
                              + "arn:aws:s3:::mock-curated-bucket/*",
                            ]
                          + Sid      = "ReadDataLakeS3Buckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # data.aws_iam_policy_document.glue_etl_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_etl_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "s3:GetObject"
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::mock-transformed-bucket/*",
                              + "arn:aws:s3:::mock-raw-bucket/*",
                              + "arn:aws:s3:::mock-glue-bucket/*",
                              + "arn:aws:s3:::mock-curated-bucket/*",
                            ]
                          + Sid      = "ReadDataLakeS3Buckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:PutObject",
                              + "s3:DeleteObject",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::mock-transformed-bucket/*",
                              + "arn:aws:s3:::mock-raw-bucket/*",
                              + "arn:aws:s3:::mock-curated-bucket/*",
                            ]
                          + Sid      = "WriteDataLakeS3TransformedBuckets"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = [
                              + "kms:ReEncryptTo",
                              + "kms:ReEncryptFrom",
                              + "kms:GenerateDataKeyWithoutPlaintext",
                              + "kms:GenerateDataKey",
                              + "kms:Encrypt",
                              + "kms:DescribeKey",
                              + "kms:Decrypt",
                            ]
                          + Condition = {
                              + "ForAnyValue:StringEquals" = {
                                  + "kms:ResourceAliases" = "alias/platform-notify-rds-snapshot-exports"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "arn:aws:kms:ca-central-1:454671348950:key/*"
                          + Sid       = "UseNotifyRdsExportKey"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "cloudwatch:PutMetricData"
                          + Effect   = "Allow"
                          + Resource = "*"
                          + Sid      = "PutCloudWatchMetrics"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
        ]
    }

  # data.aws_iam_policy_document.glue_kms will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_kms" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UseGlueKey"
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:454671348950:log-group:/aws-glue/crawlers*",
              + "arn:aws:logs:ca-central-1:454671348950:log-group:/aws-glue/jobs*",
              + "arn:aws:logs:ca-central-1:454671348950:log-group:/aws-glue/python-jobs*",
              + "arn:aws:logs:ca-central-1:454671348950:log-group:/aws-glue/sessions*",
            ]
          + sid       = "AssociateKmsKey"
        }
    }

  # aws_glue_catalog_database.bes_crm_salesforce_production will be created
  + resource "aws_glue_catalog_database" "bes_crm_salesforce_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /bes/crm/salesforce/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "bes_crm_salesforce_staging"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.operations_aws_production will be created
  + resource "aws_glue_catalog_database" "operations_aws_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /operations/aws/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_aws_staging"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.operations_aws_production_raw will be created
  + resource "aws_glue_catalog_database" "operations_aws_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /operations/aws/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_aws_staging_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_gc_forms_production will be created
  + resource "aws_glue_catalog_database" "platform_gc_forms_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/gc-forms/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_forms_staging"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_gc_forms_production_raw will be created
  + resource "aws_glue_catalog_database" "platform_gc_forms_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /platform/gc-forms/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_forms_staging_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_gc_notify_production will be created
  + resource "aws_glue_catalog_database" "platform_gc_notify_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/gc-notify/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_gc_notify_staging"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_support_production will be created
  + resource "aws_glue_catalog_database" "platform_support_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "TRANSFORMED: data source path: /platform/support/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_support_staging"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_catalog_database.platform_support_production_raw will be created
  + resource "aws_glue_catalog_database" "platform_support_production_raw" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "RAW: data source path: /platform/support/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "platform_support_staging_raw"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_classifier.json_object_array will be created
  + resource "aws_glue_classifier" "json_object_array" {
      + id   = (known after apply)
      + name = "json_object_array"

      + json_classifier {
          + json_path = "$[*]"
        }
    }

  # aws_glue_crawler.operations_aws_production_account_tags will be created
  + resource "aws_glue_crawler" "operations_aws_production_account_tags" {
      + arn                    = (known after apply)
      + classifiers            = [
          + "json_object_array",
        ]
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 1
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_staging_raw"
      + description            = "Classify the AWS Organization account tag extract"
      + id                     = (known after apply)
      + name                   = "Operations / AWS / Organization / Account Tags"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "account_tags_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/organization"
        }
    }

  # aws_glue_crawler.operations_aws_production_cost_usage_report will be created
  + resource "aws_glue_crawler" "operations_aws_production_cost_usage_report" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 2
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_staging_raw"
      + description            = "Classify the AWS Organization Cost and Usage Report data"
      + id                     = (known after apply)
      + name                   = "Operations / AWS / Cost and Usage Report"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "cost_usage_report_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/cost-usage-report"
        }
    }

  # aws_glue_crawler.platform_gc_forms_templates_production_raw will be created
  + resource "aws_glue_crawler" "platform_gc_forms_templates_production_raw" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 5
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "platform_gc_forms_staging_raw"
      + description            = "Classify the raw GC Forms template data"
      + id                     = (known after apply)
      + name                   = "Platform / GC Forms / Templates"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_gc_forms_raw_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/platform/gc-forms"
        }
    }

  # aws_glue_crawler.platform_support_freshdesk_production will be created
  + resource "aws_glue_crawler" "platform_support_freshdesk_production" {
      + arn                    = (known after apply)
      + classifiers            = [
          + "json_object_array",
        ]
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 1
                    }
                }
              + CreatePartitionIndex = true
              + Grouping             = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version              = 1
            }
        )
      + database_name          = "platform_support_staging_raw"
      + description            = "Classify the Platform Freshdesk support ticket data"
      + id                     = (known after apply)
      + name                   = "Platform / Support / Freshdesk"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "platform_support_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/platform/support/freshdesk"
        }
    }

  # aws_glue_job.bes_crm_salesforce will be created
  + resource "aws_glue_job" "bes_crm_salesforce" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "bes_crm_salesforce"
          + "--database_name_transformed"        = "bes_crm_salesforce_staging"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--source_bucket"                    = "mock-raw-bucket"
          + "--source_prefix"                    = "bes/crm/salesforce/"
          + "--table_name"                       = "account_opportunity"
          + "--transformed_bucket"               = "mock-transformed-bucket"
          + "--transformed_prefix"               = "bes/crm/salesforce/"
        }
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = 0.0625
      + name                   = "BES / CRM / Salesforce"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3.9"
          + runtime         = (known after apply)
          + script_location = "s3://mock-glue-bucket/bes/crm/salesforce/process_salesforce.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.platform_gc_forms_job will be created
  + resource "aws_glue_job" "platform_gc_forms_job" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/python-jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "platform_gc_forms"
          + "--database_name_raw"                = "platform_gc_forms_staging_raw"
          + "--database_name_transformed"        = "platform_gc_forms_staging"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--source_bucket"                    = "mock-raw-bucket"
          + "--source_prefix"                    = "platform/gc-forms"
          + "--table_name_prefix"                = "platform_gc_forms"
          + "--transformed_bucket"               = "mock-transformed-bucket"
          + "--transformed_prefix"               = "platform/gc-forms"
        }
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = 1
      + name                   = "Platform / GC Forms"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3.9"
          + runtime         = (known after apply)
          + script_location = "s3://mock-glue-bucket/platform/gc_forms/process_data.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.platform_gc_notify_job will be created
  + resource "aws_glue_job" "platform_gc_notify_job" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--additional-python-modules"        = "s3://mock-glue-bucket/platform/gc_notify/requirements.txt"
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "platform_gc_notify"
          + "--database_name_transformed"        = "platform_gc_notify_staging"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--python-modules-installer-option"  = "-r"
          + "--source_bucket"                    = "mock-raw-bucket"
          + "--source_prefix"                    = "platform/gc-notify"
          + "--table_config_object"              = "s3://mock-glue-bucket/platform/gc_notify/tables.zip"
          + "--table_name_prefix"                = "platform_gc_notify"
          + "--target_env"                       = "staging"
          + "--transformed_bucket"               = "mock-transformed-bucket"
          + "--transformed_prefix"               = "platform/gc-notify"
        }
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "Platform / GC Notify"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 30
      + worker_type            = "G.2X"

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://mock-glue-bucket/platform/gc_notify/process_data.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_job.platform_support_freshdesk will be created
  + resource "aws_glue_job" "platform_support_freshdesk" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/python-jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "platform_support_freshdesk"
          + "--database_name_raw"                = "platform_support_staging_raw"
          + "--database_name_transformed"        = "platform_support_staging"
          + "--enable-auto-scaling"              = "true"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-job-insights"              = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--job-language"                     = "python"
          + "--source_bucket"                    = "mock-raw-bucket"
          + "--source_prefix"                    = "platform/support/freshdesk/"
          + "--table_name"                       = "platform_support_freshdesk"
          + "--transformed_bucket"               = "mock-transformed-bucket"
          + "--transformed_prefix"               = "platform/support/freshdesk/"
        }
      + glue_version           = "5.0"
      + id                     = (known after apply)
      + max_capacity           = 1
      + name                   = "Platform / Support / Freshdesk"
      + number_of_workers      = (known after apply)
      + role_arn               = (known after apply)
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = 15
      + worker_type            = (known after apply)

      + command {
          + name            = "pythonshell"
          + python_version  = "3.9"
          + runtime         = (known after apply)
          + script_location = "s3://mock-glue-bucket/platform/support/freshdesk/process_tickets.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_glue_resource_policy.cross_account_access will be created
  + resource "aws_glue_resource_policy" "cross_account_access" {
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = []
                        }
                      + Resource  = [
                          + "arn:aws:glue:ca-central-1:454671348950:table/bes_crm_salesforce_staging/*",
                          + "arn:aws:glue:ca-central-1:454671348950:database/bes_crm_salesforce_staging",
                          + "arn:aws:glue:ca-central-1:454671348950:catalog",
                        ]
                      + Sid       = "SupersetReadAccessBesCrmSalesforceStaging"
                    },
                  + {
                      + Action    = [
                          + "glue:GetTables",
                          + "glue:GetTableVersions",
                          + "glue:GetTableVersion",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:GetPartition",
                          + "glue:GetDatabases",
                          + "glue:GetDatabase",
                          + "glue:BatchGetPartition",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = []
                        }
                      + Resource  = [
                          + "arn:aws:glue:ca-central-1:454671348950:table/operations_aws_staging/*",
                          +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
